КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Documents/ЗаданиеНаПеревозку/ЗаданиеНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d371a3f9-8a6a-4f41-8820-d9a12b2d57af">
  <name>ЗаданиеНаПеревозку</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="92c5bd39-d761-43bd-97cc-896ab99e46df">
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c548e8bf-5d8a-4346-ad11-7346a15a55c4">
    <name>ТранспортноеСредство</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f2bb5d9e-b206-4bc7-bae0-62643128676c">
    <name>КурьерЭкспедитор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="581369d9-44ec-4e70-98c7-55ba3307b1e9">
    <name>ДатаВремяРейсаПланПо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="185053d9-9762-4036-a99d-ce89c6afcd73">
    <name>ДатаВремяРейсаПланС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="918ed87c-0276-4e11-a450-1d4bb121e1c3">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b30444bc-b440-4396-b3ce-d70c3c684ecb">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="94a8b47c-9cae-4633-adb3-391049c640d5">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ed075445-26f4-452d-905d-f3e2e3ebdb25">
    <name>ЗаданиеВыполняет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="aa7fd4d4-d68f-4ceb-ac95-6650eaa94338">
    <name>ДатаВремяРейсаФактПо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2b9fe414-2272-4679-94d0-f2aad4a40f51">
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="63702177-349b-4d17-bf16-d6891f186bf0">
    <name>Операция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f447f68b-e419-49e0-b86a-301f0e7980f4">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="42877410-8859-4810-b356-14180c6fd9e4">
    <name>ДатаВремяРейсаФактС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6f4077b4-3d45-4d14-9d79-cb03f40f871f">
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0f2c1a2e-cb86-4455-90e2-890834134774">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="fc7e7f69-66c0-4524-9af0-f84439c47b6b">
    <name>Распоряжения</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="89a28c00-b22c-4a61-a9e9-df53927e4978">
      <name>Распоряжение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d1923f33-8770-4a7e-892d-1ea3c4e90ad1">
      <name>Вес</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b7d67d85-7e2c-4e0f-bebe-c31e9180e68f">
      <name>Объем</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="cb6ed3da-0d41-46c3-b5dd-b9fb617c075e">
      <name>КлючСвязи</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="4f2eb382-0750-4b94-8d10-6be4259cccd6">
      <name>ПолучательОтправитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="15b3905e-1f40-4d8c-9f31-cde2f3907a9e">
    <name>Маршрут</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="53fe645f-571c-4df4-ade9-2ee78eb589c6">
      <name>Вес</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="73f69371-efc1-411d-88e3-a54d75fca5fe">
      <name>Объем</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b9b978cb-d533-4778-a7c0-4c5b981f0cf2">
      <name>КлючСвязи</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="4a9b3cc0-c14f-42c9-853f-2377c4e71c15">
      <name>ДополнительнаяИнформация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="68fb98bd-34a2-44b6-bb6f-97d8ec682ff2">
      <name>Доставлено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d39b5bf7-ae63-4518-9a48-f9131061ff6a">
      <name>Адрес</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="f72237d5-29a8-4168-a456-39b76513b45b">
      <name>Зона</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f0e45492-af13-445e-b5d6-a94ca1031eed">
      <name>ВремяС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Documents/ЗаданиеНаПеревозку/ObjectModule.bsl
&После("ПередЗаписью")
Процедура ОД_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Для каждого СтрокаДок Из Распоряжения Цикл
	
		Если ТипЗнч(СтрокаДок.Распоряжение) <> Тип("ДокументСсылка.Рекламация") Тогда
			Продолжить;
		КонецЕсли;

		РекламацияВес = 0;
		РекламацияОбъем = 0;
		Для каждого Т Из СтрокаДок.Распоряжение.Комплектующие Цикл
			ВесОбъем = ОД_ОбщиеФункции.ПолучитьВесОбъемДляСтроки(Т);
			РекламацияВес = РекламацияВес + ВесОбъем.Вес;
			РекламацияОбъем = РекламацияОбъем + ВесОбъем.Объем;
		КонецЦикла;
		
		СтрокаДок.Вес = РекламацияВес;
		СтрокаДок.Объем = РекламацияОбъем;
		
		СтрокаДок.ПолучательОтправитель = СтрокаДок.Распоряжение.Партнер;
	КонецЦикла;
	
	Для каждого СтрокаДок Из Маршрут Цикл
	
		НайденыСтроки = Распоряжения.НайтиСтроки(Новый Структура("КлючСвязи", СтрокаДок.КлючСвязи));
		
		КлючВес = 0;
		КлючОбъем = 0;
		Для каждого Т Из НайденыСтроки Цикл
			КлючВес = КлючВес + Т.Вес;
			КлючОбъем = КлючОбъем + Т.Объем;
		КонецЦикла;
		
		СтрокаДок.Вес = КлючВес;
		СтрокаДок.Объем = КлючОбъем;
	КонецЦикла;
	
	// Вес и Объем в единицах измерения
	Вес   = Маршрут.Итог("Вес") * ДоставкаТоваров.КоэффициентПересчетаВТонны();
	Объем = Маршрут.Итог("Объем") * ДоставкаТоваров.КоэффициентПересчетаВКубическиеМетры();
	
КонецПроцедуры
